In [1]:
import pandas as pd
adult = pd.read_csv('/Users/ecuerbo/Desktop/data/adult.csv')

In [2]:
adult_dtypes = {
    "workclass" : "category",
    "education" : "category",
    "relationship":'category',
    'marital.status':'category',
    'income':"category",
    'race':"category",
    'occupation':"category",
    'native.country':"category",
    "sex":"category"
}

adult = pd.read_csv('/Users/ecuerbo/Desktop/data/adult.csv',
    dtype=adult_dtypes)
print(adult.dtypes)

age                  int64
workclass         category
fnlwgt               int64
education         category
education.num        int64
marital.status    category
occupation        category
relationship      category
race              category
sex               category
capital.gain         int64
capital.loss         int64
hours.per.week       int64
native.country    category
income            category
dtype: object

In [3]:
adult2 = pd.read_csv('/Users/ecuerbo/Desktop/data/adult.csv')
print("With non categoricals / With categoricals: ",adult2['sex'].nbytes/adult['sex'].nbytes)

With non categoricals / With categoricals:  7.996070847530467

In [4]:
adult[adult["occupation"]=='Farming-fishing'].groupby(by=['income','sex','native.country']).mean().dropna()

                                    age         fnlwgt  education.num  \
income sex    native.country
<=50K  Female Guatemala       43.500000  411495.000000       5.000000
              Mexico          43.000000  261318.333333       5.000000
              Puerto-Rico     23.000000  175837.000000       7.000000
              United-States   40.736842  162975.807018       8.859649
       Male   ?               33.200000  132382.000000       7.400000
              Canada          57.500000  237719.500000       8.000000
              Cuba            41.000000  297192.000000       4.500000
              El-Salvador     31.000000  288561.500000       5.500000
              England         33.000000  176711.000000      13.000000
              France          64.000000   59829.000000       9.000000
              Germany         62.000000  197286.000000       8.000000
              Guatemala       32.000000  239140.500000       3.000000
              Hong            19.000000  277695.000000       1.000000
              Ireland         31.000000   63437.000000       9.000000
              Italy           45.500000  161745.500000       6.000000
              Japan           44.000000  156687.000000       9.000000
              Mexico          32.763889  294927.333333       4.222222
              Philippines     48.500000   95682.500000       6.000000
              Poland          23.000000  324960.000000       9.000000
              Portugal        38.000000  331395.000000       4.000000
              Puerto-Rico     32.000000  157360.250000       7.500000
              United-States   41.171589  162025.662447       8.915612
              Vietnam         71.500000  234831.500000       9.500000
>50K   Female United-States   55.000000  158805.000000      10.000000
       Male   Cambodia        42.000000  303044.000000       9.000000
              Mexico          42.500000  201126.500000       3.000000
              United-States   47.155963  131898.798165      10.119266
              Yugoslavia      35.000000   81280.000000      13.000000

                              capital.gain  capital.loss  hours.per.week
income sex    native.country
<=50K  Female Guatemala           0.000000      0.000000       42.500000
              Mexico              0.000000      0.000000       41.666667
              Puerto-Rico         0.000000      0.000000       40.000000
              United-States     506.824561     94.228070       37.824561
       Male   ?                   0.000000      0.000000       46.800000
              Canada              0.000000      0.000000       55.000000
              Cuba             2254.000000      0.000000       40.000000
              El-Salvador         0.000000      0.000000       35.000000
              England             0.000000      0.000000       40.000000
              France              0.000000      0.000000       25.000000
              Germany             0.000000      0.000000       48.000000
              Guatemala           0.000000      0.000000       40.000000
              Hong                0.000000      0.000000       36.000000
              Ireland             0.000000      0.000000       40.000000
              Italy               0.000000      0.000000       40.000000
              Japan               0.000000      0.000000       42.000000
              Mexico            702.875000      0.000000       42.694444
              Philippines         0.000000      0.000000       40.000000
              Poland              0.000000      0.000000       40.000000
              Portugal         3942.000000      0.000000       84.000000
              Puerto-Rico         0.000000      0.000000       50.000000
              United-States     204.098453     42.482419       47.180028
              Vietnam             0.000000   1228.500000       40.000000
>50K   Female United-States   19174.000000      0.000000       25.000000
       Male   Cambodia            0.000000      0.000000       40.000000
              Mexico              0.000000      0.000000       48.000000
              United-States    2887.889908    226.275229       54.889908
              Yugoslavia          0.000000      0.000000       65.000000

In [5]:
adult[adult['workclass']=='Never-worked'][['sex','income','native.country']].value_counts()

sex     income  native.country
Male    <=50K   United-States     5
Female  <=50K   United-States     2
dtype: int64

In [6]:
adult.groupby(by=['income']).median()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
income,,,,,,
<=50K,34.0,179465.0,9.0,0.0,0.0,40.0
>50K,44.0,176101.0,12.0,0.0,0.0,40.0

In [7]:
adult[['income','relationship']].value_counts()

income  relationship
<=50K   Not-in-family     7449
        Husband           7275
>50K    Husband           5918
<=50K   Own-child         5001
        Unmarried         3228
        Other-relative     944
>50K    Not-in-family      856
<=50K   Wife               823
>50K    Wife               745
        Unmarried          218
        Own-child           67
        Other-relative      37
dtype: int64

In [8]:
adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education.num',
       'marital.status', 'occupation', 'relationship', 'race', 'sex',
       'capital.gain', 'capital.loss', 'hours.per.week', 'native.country',
       'income'],
      dtype='object')

In [9]:
a=adult.columns.values
print(a)

['age' 'workclass' 'fnlwgt' 'education' 'education.num' 'marital.status'
 'occupation' 'relationship' 'race' 'sex' 'capital.gain' 'capital.loss'
 'hours.per.week' 'native.country' 'income']

In [10]:
adult.sort_values('capital.loss', ascending=False)

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11859,33,Private,394447,Masters,14,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,33,United-States,>50K
11858,47,Private,121124,9th,5,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,<=50K
11857,55,Self-emp-inc,67433,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States,<=50K
11856,20,Private,277700,Preschool,1,Never-married,Other-service,Own-child,White,Male,0,0,32,United-States,<=50K
32560,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K

In [11]:
adult.sort_values(['capital.loss','hours.per.week'], ascending=[1,1])

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
4086,69,?,320280,Some-college,10,Never-married,?,Not-in-family,White,Male,1848,0,1,United-States,<=50K
4129,66,Self-emp-inc,150726,9th,5,Married-civ-spouse,Exec-managerial,Husband,White,Male,1409,0,1,?,<=50K
4396,58,State-gov,109567,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,1,United-States,>50K
5327,69,?,195779,Assoc-voc,11,Widowed,?,Not-in-family,White,Female,0,0,1,United-States,<=50K
9077,78,?,363134,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,0,1,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K

In [12]:
sub_cols=['marital.status', 'occupation','age']
adult[sub_cols]

           marital.status         occupation  age
0                 Widowed                  ?   90
1                 Widowed    Exec-managerial   82
2                 Widowed                  ?   66
3                Divorced  Machine-op-inspct   54
4               Separated     Prof-specialty   41
...                   ...                ...  ...
32556       Never-married    Protective-serv   22
32557  Married-civ-spouse       Tech-support   27
32558  Married-civ-spouse  Machine-op-inspct   40
32559             Widowed       Adm-clerical   58
32560       Never-married       Adm-clerical   22

[32561 rows x 3 columns]

In [13]:
adult[adult['capital.loss']>1][['age','education.num','hours.per.week']].describe()

               age  education.num  hours.per.week
count  1519.000000    1519.000000     1519.000000
mean     41.697828      10.969059       43.252798
std      12.625609       2.688426       12.247258
min      17.000000       1.000000        1.000000
25%      32.000000       9.000000       40.000000
50%      41.000000      10.000000       40.000000
75%      50.000000      13.000000       50.000000
max      90.000000      16.000000       99.000000

In [14]:
#compare mean incomes for specific countries
countries=['Mexico',"Philippines",'United-States','Germany']
mask = adult['native.country'].isin(countries)
concern =  adult[mask]
concern.groupby(by=['income','native.country']).median().round(0).dropna()

                        age    fnlwgt  education.num  capital.gain  \
income native.country
<=50K  Germany         33.0  177566.0           10.0           0.0
       Mexico          31.0  256482.0            5.0           0.0
       Philippines     35.0  147638.0           10.0           0.0
       United-States   34.0  176967.0            9.0           0.0
>50K   Germany         46.0  181110.0           12.0           0.0
       Mexico          40.0  286370.0           10.0           0.0
       Philippines     42.0  171225.0           13.0           0.0
       United-States   44.0  175990.0           12.0           0.0

                       capital.loss  hours.per.week
income native.country
<=50K  Germany                  0.0            40.0
       Mexico                   0.0            40.0
       Philippines              0.0            40.0
       United-States            0.0            40.0
>50K   Germany                  0.0            45.0
       Mexico                   0.0            40.0
       Philippines              0.0            40.0
       United-States            0.0            40.0

In [15]:
#examine mexico
adult[adult['native.country']=="Mexico"]["age"].median()

31.0

In [16]:
adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  category
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  category
 4   education.num   32561 non-null  int64
 5   marital.status  32561 non-null  category
 6   occupation      32561 non-null  category
 7   relationship    32561 non-null  category
 8   race            32561 non-null  category
 9   sex             32561 non-null  category
 10  capital.gain    32561 non-null  int64
 11  capital.loss    32561 non-null  int64
 12  hours.per.week  32561 non-null  int64
 13  native.country  32561 non-null  category
 14  income          32561 non-null  category
dtypes: category(9), int64(6)
memory usage: 1.8 MB

In [17]:
adult['marital.status'].describe()

count                  32561
unique                     7
top       Married-civ-spouse
freq                   14976
Name: marital.status, dtype: object

In [18]:
adult['marital.status'].value_counts()

Married-civ-spouse       14976
Never-married            10683
Divorced                  4443
Separated                 1025
Widowed                    993
Married-spouse-absent      418
Married-AF-spouse           23
Name: marital.status, dtype: int64

In [19]:
adult.dtypes

age                  int64
workclass         category
fnlwgt               int64
education         category
education.num        int64
marital.status    category
occupation        category
relationship      category
race              category
sex               category
capital.gain         int64
capital.loss         int64
hours.per.week       int64
native.country    category
income            category
dtype: object

In [20]:
my_data = ['A',"A","C","B","A","C"]
my_series1 = pd.Categorical(my_data, categories=["C","B","A"], ordered=True)
print(my_series1)

['A', 'A', 'C', 'B', 'A', 'C']
Categories (3, object): ['C' < 'B' < 'A']

In [21]:
my_series1.nbytes

30

In [22]:
adult['sex'].dtype

CategoricalDtype(categories=['Female', 'Male'], ordered=False)

In [23]:
#adoptable dogs dataset
#https://www.kaggle.com/datasets/jmolitoris/adoptable-dogs/data
dogs = pd.read_csv('/Users/ecuerbo/Desktop/data/dogs.csv')
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2937 entries, 0 to 2936
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 2937 non-null   int64
 1   name               2845 non-null   object
 2   age                2937 non-null   float64
 3   sex                2937 non-null   object
 4   breed              2937 non-null   object
 5   date_found         2937 non-null   object
 6   adoptable_from     2937 non-null   object
 7   posted             2937 non-null   object
 8   color              2937 non-null   object
 9   coat               2937 non-null   object
 10  size               2937 non-null   object
 11  neutered           1852 non-null   object
 12  housebroken        460 non-null    object
 13  likes_people       1999 non-null   object
 14  likes_children     1219 non-null   object
 15  get_along_males    1633 non-null   object
 16  get_along_females  1673 non-null   object
 17  get_along_cats     431 non-null    object
 18  keep_in            1916 non-null   object
dtypes: float64(1), int64(1), object(17)
memory usage: 436.1+ KB

In [24]:
dogs["coat"] = dogs["coat"].astype("category")
dogs["coat"].value_counts(dropna=False)

short         1972
medium         565
wirehaired     220
long           180
Name: coat, dtype: int64

In [25]:
#Series.cat.method_name
dogs["coat"] = dogs["coat"].cat.set_categories(
    new_categories=["short","medium","long"])
dogs["coat"].value_counts(dropna=False)

short     1972
medium     565
NaN        220
long       180
Name: coat, dtype: int64

In [26]:
dogs["coat"] = dogs["coat"].cat.set_categories(
    new_categories=["short","medium","long"],
    ordered=True)
dogs["coat"].head(3)

0    short
1    short
2    short
Name: coat, dtype: category
Categories (3, object): ['short' < 'medium' < 'long']

In [27]:
#missing categories
dogs["likes_people"].value_counts(dropna=False)

yes    1991
NaN     938
no        8
Name: likes_people, dtype: int64

In [29]:
#adding categories
dogs["likes_people"] = dogs["likes_people"].astype("category")
dogs["likes_people"] = dogs["likes_people"].cat.add_categories(
    new_categories =["did not check","could not tell"])
dogs["likes_people"].cat.categories

Index(['no', 'yes', 'did not check', 'could not tell'], dtype='object')

In [30]:
dogs["likes_people"].value_counts(dropna=False)

yes               1991
NaN                938
no                   8
did not check        0
could not tell       0
Name: likes_people, dtype: int64

In [40]:
#remove the wirehaired
dogs = pd.read_csv('/Users/ecuerbo/Desktop/data/dogs.csv')
dogs["coat"] = dogs["coat"].astype("category")
dogs["coat"] = dogs["coat"].cat.remove_categories(removals=["wirehaired"])
dogs["coat"].cat.categories

Index(['long', 'medium', 'short'], dtype='object')

In [36]:
dogs["coat"].value_counts(dropna=0)

short     1972
medium     565
NaN        220
long       180
Name: coat, dtype: int64

In [37]:
# Check frequency counts while also printing the NaN count
print(dogs["keep_in"].value_counts(dropna=False))

# Switch to a categorical variable
dogs["keep_in"] = dogs["keep_in"].astype("category")

# Add new categories
new_categories = ["Unknown History", "Open Yard (Countryside)"]
dogs["keep_in"] = dogs["keep_in"].cat.add_categories(new_categories)

# Check frequency counts one more time
print(dogs["keep_in"].value_counts(dropna=False))

both flat and garden    1224
NaN                     1021
garden                   510
flat                     182
Name: keep_in, dtype: int64
both flat and garden       1224
NaN                        1021
garden                      510
flat                        182
Unknown History               0
Open Yard (Countryside)       0
Name: keep_in, dtype: int64

In [44]:
dogs["likes_children"]=dogs["likes_children"].astype('category')
# Set "maybe" to be "no"
dogs.loc[dogs["likes_children"] == "maybe", "likes_children"] = "no"

# Print out categories
print(dogs["likes_children"].cat.categories)

# Print the frequency table
print(dogs["likes_children"].value_counts())

# Remove the `"maybe" category
#dogs["likes_children"] = dogs["likes_children"].cat.remove_categories(["maybe"])
#print(dogs["likes_children"].value_counts())

# Print the categories one more time
#print(dogs["likes_children"].cat.categories)

Index(['no', 'yes'], dtype='object')
yes    1172
no       47
Name: likes_children, dtype: int64

In [45]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2937 entries, 0 to 2936
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 2937 non-null   int64
 1   name               2845 non-null   object
 2   age                2937 non-null   float64
 3   sex                2937 non-null   object
 4   breed              2937 non-null   object
 5   date_found         2937 non-null   object
 6   adoptable_from     2937 non-null   object
 7   posted             2937 non-null   object
 8   color              2937 non-null   object
 9   coat               2717 non-null   category
 10  size               2937 non-null   object
 11  neutered           1852 non-null   object
 12  housebroken        460 non-null    object
 13  likes_people       1999 non-null   object
 14  likes_children     1219 non-null   category
 15  get_along_males    1633 non-null   object
 16  get_along_females  1673 non-null   object
 17  get_along_cats     431 non-null    object
 18  keep_in            1916 non-null   object
dtypes: category(2), float64(1), int64(1), object(15)
memory usage: 396.2+ KB

In [56]:
dogs.groupby(by=["sex","coat"])[["neutered"]].count()

               neutered
sex    coat
female long          40
       medium       123
       short        582
male   long          77
       medium       221
       short        659